[V11.0]
1=<a>Nouveau Software Health</a> permet de gérer les autorisations logicielles, de bloquer les notifications popup, de nettoyer les fichiers d'installation inutiles et de supprimer les logiciels malveillants & les extensions de navigateur.
2=<a>Moteur de désinstallation plus puissant</a> élimine plus complètement les fichiers résiduels grâce à des algorithmes d'analyse et de nettoyage avancés.
3=<a>Moniteur d'installation plus approfondi</a> peut enregistrer plus d'éléments (y compris les démarrages) créés pendant le processus d'installation pour une désinstallation ultérieure approfondie
4=<a>Base de données 50 % plus élargie</a> supporte la mise à jour de logiciels plus populaires, notamment AnyDesk, Calibre, Discord, LibreOffice et qBittorrent.
5=<a>Base de données unique de suppression des programmes récalcitrants</a> supporte la suppression de plus de 1000 programmes récalcitrants.
6=<a>Désinstallation forcée </a> peut facilement désinstaller des programmes lorsque les registres de désinstallation sont manquants.
7=<a>Nouveau classement des applications Windows</a> permet aux utilisateurs d'en savoir plus sur la suppression des applications Windows indésirables.
8=<a>Amélioration du processus de suppression</a> des extensions de navigateur
9=<a>Meilleure interface utilisateur</a> pour une expérience plus conviviale.
10=<a>Deux modes :</a> sombre et clair
11=<a>37 Langues prises en charge</a>.
12=<a>Prise en charge complète de Windows 11</a>.